[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co.com/khHN7Pk/9780143454212.jpg",
    "review": "'The Great Gatsby' by F. Scott Fitzgerald is a timeless masterpiece that delves into the decadence and disillusionment of the Jazz Age. Set in the Roaring Twenties, the novel unveils the enigmatic Jay Gatsby's extravagant parties, masking a pursuit of lost love. Narrated by Nick Carraway, the story explores themes of wealth, love, and the American Dream, drawing readers into a vivid portrayal of the glittering yet elusive world of the East and West Egg. Fitzgerald's prose is both poetic and haunting, weaving a compelling narrative that transcends its era. A poignant exploration of societal excess and the human condition, 'The Great Gatsby' remains a literary gem that resonates across generations.",
    "totalPages": 192,
    "rating": 4.5,
    "category": "Classic",
    "tags": ["Fiction", "Romance"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co.com/0cv102J/To-Kill-a-Mockingbird.webp",
    "review": "Set in the racially charged American South during the 1930s, Harper Lee’s masterpiece is a profound exploration of human morality. Through young Scout Finch’s eyes, readers witness the integrity of her father, Atticus Finch, as he defends a Black man falsely accused of rape. The novel addresses the deep-rooted injustices of racism, while also celebrating compassion, childhood innocence, and the courage to stand for what is right. Lee’s storytelling is both gentle and powerful, leaving a lifelong impression about empathy and the complexity of human behavior.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Drama", "Social Justice"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co.com/MprDyVt/51-BIA4rrae-L-AC-UF1000-1000-QL80.jpg",
    "review": "Orwell’s dystopian vision remains chillingly relevant. In a world dominated by Big Brother, where truth is manufactured and privacy is extinct, “1984” is a scathing critique of authoritarianism and ideological control. Winston Smith’s quiet rebellion and doomed love affair highlight the psychological toll of living under constant surveillance. The novel is not just a political warning, but also a philosophical meditation on freedom, language, and the fragility of truth. Orwell’s precise and haunting prose immerses the reader in a terrifyingly plausible world.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co.com/tYSWRfG/catcherrye-edited-1-800x.png",
    "review": "Holden Caulfield’s first-person narrative captures the confusion and resistance of youth in a world he sees as phony. As he wanders through New York City, wrestling with grief, depression, and disillusionment, readers glimpse a deeply sensitive soul seeking authenticity. The novel’s stream-of-consciousness style, raw emotion, and biting humor resonate with anyone who has felt lost in the transition from adolescence to adulthood. Salinger’s work is not just a coming-of-age story, but a poignant exploration of the human need for connection and meaning.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Young Adult", "Identity"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co.com/YdQDMpn/81me-ud-V63-L-AC-UF1000-1000-QL80.jpg",
    "review": "Austen’s witty, romantic classic delves into the intricacies of societal expectations in Regency England. Through Elizabeth Bennet’s spirited resistance and Mr. Darcy’s emotional evolution, the novel highlights the importance of marrying for love rather than status. The sharp dialogue and satirical take on class divisions underscore Austen’s feminist undertones. Beyond the charm of its romance, “Pride and Prejudice” is a brilliant social commentary that questions conformity and celebrates personal growth.",
    "totalPages": 279,
    "rating": 4.7,
    "category": "Classic",
    "tags": ["Romance", "Satire"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co.com/xS8YvxL/81m-CE-uclx-L-UF1000-1000-QL80.jpg",
    "review": "This enchanting prelude to The Lord of the Rings follows the journey of Bilbo Baggins, an unassuming hobbit drawn into a perilous quest. Tolkien crafts a rich tapestry of fantasy, filled with dragons, dwarves, riddles, and bravery. At its core, the story is about stepping out of one’s comfort zone and discovering one’s potential. Bilbo’s transformation from a timid homebody to a clever and courageous hero is timeless. The novel’s themes of friendship, honor, and the tension between greed and generosity make it a cornerstone of fantasy literature.",
    "totalPages": 310,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Adventure", "Epic"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co.com/989qMRW/42844155.jpg",
    "review": "Rowling’s first installment in the beloved Harry Potter series is a heartwarming introduction to a magical universe where friendship, loyalty, and bravery are the strongest spells of all. As young Harry escapes a loveless life to discover his identity at Hogwarts, the novel explores themes of belonging, courage in the face of darkness, and the power of choice. Woven with whimsical details and moral lessons, it’s a coming-of-age tale that charms readers of all ages while laying the groundwork for an epic saga of heroism and sacrifice.",
    "totalPages": 309,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Magic", "Young Adult"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 8,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co.com/zS9jsdK/18144590.jpg",
    "review": "This philosophical tale follows Santiago, a shepherd boy on a quest to find his Personal Legend. Blending mysticism and metaphor, Coelho weaves a simple yet profound story about listening to one’s heart and pursuing one’s dreams despite fear and doubt. The desert journey is symbolic of the inner quest for meaning and purpose, offering insights into spiritual fulfillment and the interconnectedness of all things. With poetic prose and universal truths, The Alchemist is an inspiring read that encourages readers to seek their true path.",
    "totalPages": 177,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Philosophical", "Adventure"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 9,
    "bookName": "The Girl on the Train",
    "author": "Paula Hawkins",
    "image": "https://i.ibb.co.com/P6hfCmJ/Whats-App-Image-2024-05-22-at-11-21-25-2e21ae46.jpg",
    "review": "In this gripping psychological thriller, Rachel’s daily train ride past a seemingly perfect couple turns into a dark mystery as she becomes entangled in a missing person case. Hawkins explores the unreliability of memory, the effects of trauma, and the blurry lines between perception and reality. The narrative unfolds through multiple perspectives, keeping readers on edge while gradually revealing disturbing truths. The novel’s portrayal of flawed characters, domestic secrets, and emotional vulnerability makes it a compelling dive into the shadows of the human mind.",
    "totalPages": 316,
    "rating": 4.2,
    "category": "Mystery",
    "tags": ["Suspense", "Psychological"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2015
  }
]
